app/Livewire/Cashier/BillingQueue.php

select * from `consultation_types` where `is_active` = 1 order by `name` asc
---
    public function consultationTypes(): \Illuminate\Database\Eloquent\Collection
    {
        return \App\Models\ConsultationType::where('is_active', true)
            ->orderBy('name')
            ->get();

select count(*) as aggregate from `medical_records` where `status` = 'for_billing'
---
    public function queueCount(): int
    {
        return MedicalRecord::where('status', 'for_billing')->count();

select count(*) as aggregate from `medical_records` where `status` = 'for_billing'
---
    public function render(): View
    {
        $records = MedicalRecord::query()
            ->where('status', 'for_billing')
            ->with(['consultationType', 'doctor', 'prescriptions' => function ($q) {
                $q->where('is_hospital_drug', true);
            }])
            ->when($this->consultationFilter, fn ($q) => $q->where('consultation_type_id', $this->consultationFilter))
            ->when($this->search, fn ($q) => $q
                ->where(function ($query) {
                    $query->where('patient_first_name', 'like', "%{$this->search}%")
                        ->orWhere('patient_last_name', 'like', "%{$this->search}%")
                        ->orWhere('record_number', 'like', "%{$this->search}%");
                }))
            ->orderBy('examination_ended_at')
            ->paginate(15);