app/Livewire/Cashier/PaymentHistory.php

select sum(`amount_paid`) as aggregate from `billing_transactions` where date(`transaction_date`) = '2026-02-20' and `payment_status` = 'paid'
---
    public function todayTotal(): float
    {
        return BillingTransaction::whereDate('transaction_date', today())
            ->where('payment_status', 'paid')
            ->sum('amount_paid');

select count(*) as aggregate from `billing_transactions` where date(`transaction_date`) = '2026-02-20' and `payment_status` = 'paid'
---
    public function todayCount(): int
    {
        return BillingTransaction::whereDate('transaction_date', today())
            ->where('payment_status', 'paid')
            ->count();