app/Livewire/Display/QueueMonitor.php

select * from `consultation_types` where `consultation_types`.`id` = 35 limit 1
---
    public function mount(?int $type = null): void
    {
        $this->consultationTypeId = $type ?? 0;

        if ($type) {
            $this->consultationType = ConsultationType::find($type);

select * from `queues` where `queue_date` = '2026-03-03 00:00:00' and `consultation_type_id` = 35 and `status` = 'called' order by `called_at` desc limit 3
---
    public function getCalledQueuesProperty(): \Illuminate\Database\Eloquent\Collection
    {
        return Queue::query()
            ->today()
            ->when($this->consultationTypeId, fn ($q) => $q->where('consultation_type_id', $this->consultationTypeId))
            ->where('status', 'called')
            ->orderByDesc('called_at')
            ->limit(3) // Show max 3 called at once
            ->get();

select * from `queues` where `queue_date` = '2026-03-03 00:00:00' and `consultation_type_id` = 35 and `status` = 'serving' order by `serving_started_at` asc limit 3
---
    public function getServingQueuesProperty(): \Illuminate\Database\Eloquent\Collection
    {
        return Queue::query()
            ->today()
            ->when($this->consultationTypeId, fn ($q) => $q->where('consultation_type_id', $this->consultationTypeId))
            ->where('status', 'serving')
            ->orderBy('serving_started_at')
            ->limit(3)
            ->get();

select * from `queues` where `queue_date` = '2026-03-03 00:00:00' and `consultation_type_id` = 35 and `status` = 'waiting' order by CASE priority WHEN 'emergency' THEN 1 WHEN 'urgent' THEN 2 WHEN 'normal' THEN 3 ELSE 4 END, `queue_number` asc limit 5
---
    public function getNextQueuesProperty(): \Illuminate\Database\Eloquent\Collection
    {
        return Queue::query()
            ->today()
            ->when($this->consultationTypeId, fn ($q) => $q->where('consultation_type_id', $this->consultationTypeId))
            ->where('status', 'waiting')
            ->orderByRaw("CASE priority WHEN 'emergency' THEN 1 WHEN 'urgent' THEN 2 WHEN 'normal' THEN 3 ELSE 4 END")
            ->orderBy('queue_number')
            ->limit(5)
            ->get();