app/Livewire/Display/QueueDisplaySelector.php

    public function consultationTypes(): Collection
    {
        return ConsultationType::query()
            ->where('is_active', true)
            ->withCount([
                'queues as waiting_count' => fn ($q) => $q->today()->waiting(),
                'queues as serving_count' => fn ($q) => $q->today()->serving(),
            ])
            ->orderBy('name')
            ->get();
---
select `consultation_types`.*, (select count(*) from `queues` where `consultation_types`.`id` = `queues`.`consultation_type_id` and `queue_date` = '2026-03-03 00:00:00' and `status` = 'waiting') as `waiting_count`, (select count(*) from `queues` where `consultation_types`.`id` = `queues`.`consultation_type_id` and `queue_date` = '2026-03-03 00:00:00' and `status` = 'serving') as `serving_count` from `consultation_types` where `is_active` = 1 order by `name` asc