app/Livewire/Patient/Profile.php

select * from `personal_information` where `personal_information`.`user_id` = 35 and `personal_information`.`user_id` is not null limit 1
---
    public function mount(): void
    {
        $this->user = Auth::user();
        $this->personalInfo = $this->user->personalInformation;

        if ($this->personalInfo) {
            $this->first_name = $this->personalInfo->first_name;