app/Livewire/Nurse/Dashboard.php

    public function getStatsProperty(): array
    {
        return [
            'confirmed_appointments' => Appointment::query()
                ->where('status', 'confirmed')
                ->count(),
            'today_appointments' => Appointment::query()
                ->whereDate('appointment_date', today())
                ->count(),
            'unqueued_today' => Appointment::query()
                ->where('status', 'confirmed')
                ->whereDate('appointment_date', today())
                ->doesntHave('queue')
                ->count(),
            'queue_waiting' => Queue::query()
                ->today()
                ->where('status', 'waiting')
                ->count(),
            'queue_serving' => Queue::query()
                ->today()
                ->where('status', 'serving')
                ->count(),
            'queue_completed' => Queue::query()
                ->today()
                ->where('status', 'completed')
                ->count(),
---
select count(*) as aggregate from `appointments` where `status` = 'pending'
select count(*) as aggregate from `appointments` where date(`appointment_date`) = '2026-02-11'
select count(*) as aggregate from `appointments` where `status` = 'approved' and date(`appointment_date`) = '2026-02-11'

    public function getDoctorsAvailableProperty(): \Illuminate\Support\Collection
    {
        $today = now();
        $dayOfWeek = $today->dayOfWeek;

        // Get doctors with regular schedules for today (day_of_week matches and is_available)
        $doctorIds = DoctorSchedule::query()
            ->where('schedule_type', 'regular')
            ->where('day_of_week', $dayOfWeek)
            ->where('is_available', true)
            ->pluck('user_id')
            ->unique();

        // Check for exceptions (leaves) today - where is_available is false
        $onLeaveIds = DoctorSchedule::query()
            ->where('schedule_type', 'exception')
            ->whereDate('date', $today)
            ->where('is_available', false)
            ->pluck('user_id');

        // Remove doctors on leave
        $availableDoctorIds = $doctorIds->diff($onLeaveIds);

        return User::query()
            ->role('doctor')
            ->whereIn('id', $availableDoctorIds)
            ->with(['personalInformation', 'consultationTypes'])
            ->get()
            ->map(fn (User $doctor) => [
                'id' => $doctor->id,
                'name' => $doctor->personalInformation?->full_name ?? $doctor->email,
                'specialties' => $doctor->consultationTypes->pluck('short_name')->join(', '),
                'is_serving' => Queue::query()
                    ->today()
                    ->where('doctor_id', $doctor->id)
                    ->where('status', 'serving')
                    ->exists(),
            ]);
---
select `user_id` from `doctor_schedules` where `schedule_type` = 'regular' and `day_of_week` = 3 and `is_available` = 1
select `user_id` from `doctor_schedules` where `schedule_type` = 'exception' and date(`date`) = '2026-02-11' and `is_available` = 0
select * from `personal_information` where `personal_information`.`user_id` in (24, 26, 27)
select `consultation_types`.*, `doctor_consultation_types`.`user_id` as `pivot_user_id`, `doctor_consultation_types`.`consultation_type_id` as `pivot_consultation_type_id` from `consultation_types` inner join `doctor_consultation_types` on `consultation_types`.`id` = `doctor_consultation_types`.`consultation_type_id` where `doctor_consultation_types`.`user_id` in (24, 26, 27)
select exists(select * from `queues` where `queue_date` = '2026-02-11 00:00:00' and `doctor_id` = 24 and `status` = 'serving') as `exists`

    public function getWaitTimesProperty(): \Illuminate\Support\Collection
    {
        $types = ConsultationType::query()
            ->where('is_active', true)
            ->get();
---
select * from `consultation_types` where `is_active` = 1

    public function getAlertsProperty(): array
    {
        $alerts = [];

        // Confirmed appointments for today that haven't been queued
        $unqueuedToday = Appointment::query()
            ->where('status', 'confirmed')
            ->whereDate('appointment_date', today())
            ->doesntHave('queue')
            ->count();
---
select count(*) as aggregate from `appointments` where `status` = 'pending' and `created_at` < '2026-02-11 14:09:23'

        }

        // Records with potentially abnormal vital signs today
        $abnormalVitals = MedicalRecord::query()
            ->whereDate('visit_date', today())
            ->where(function ($q) {
                // High temperature (fever)
                $q->where('temperature', '>=', 38.0)
                    // Low temperature (hypothermia)
                    ->orWhere('temperature', '<=', 35.0)
                    // High heart rate
                    ->orWhere('cardiac_rate', '>=', 120)
                    // Low heart rate
                    ->orWhere('cardiac_rate', '<=', 50)
                    // High respiratory rate
                    ->orWhere('respiratory_rate', '>=', 25);
            })
            ->count();
---
select count(*) as aggregate from `medical_records` where date(`visit_date`) = '2026-02-11' and (`temperature` >= 38 or `temperature` <= 35 or `cardiac_rate` >= 120 or `cardiac_rate` <= 50 or `respiratory_rate` >= 25)

    public function render(): View
    {
        $currentServing = Queue::query()
            ->with(['consultationType', 'appointment', 'servedBy'])
            ->today()
            ->where('status', 'serving')
            ->orderBy('serving_started_at')
            ->get();

        $recentQueue = Queue::query()
            ->with(['consultationType', 'appointment'])
            ->today()
            ->whereIn('status', ['waiting', 'called'])
            ->orderByRaw("CASE priority WHEN 'emergency' THEN 1 WHEN 'urgent' THEN 2 WHEN 'normal' THEN 3 ELSE 4 END")
            ->orderBy('queue_number')
            ->limit(5)
            ->get();
---
select * from `queues` where `queue_date` = '2026-02-11 00:00:00' and `status` = 'serving' order by `serving_started_at` asc
select * from `queues` where `queue_date` = '2026-02-11 00:00:00' and `status` in ('waiting', 'called') order by CASE priority WHEN 'emergency' THEN 1 WHEN 'urgent' THEN 2 WHEN 'normal' THEN 3 ELSE 4 END, `queue_number` asc limit 5
select * from `appointments` where `appointments`.`id` in (4, 5, 6)
select * from `consultation_types` where `consultation_types`.`id` in (34, 35, 36)