app/Livewire/Nurse/Reports.php

select * from `medical_records` where date(`created_at`) = '2026-02-11' order by `created_at` asc
select * from `appointments` where `appointments`.`id` in (4, 5, 6)
select * from `consultation_types` where `consultation_types`.`id` in (34, 35, 36)
select * from `queues` where date(`queue_date`) = '2026-02-11' order by `queue_number` asc
---
    public function dailyCensusData(): array
    {
        $date = Carbon::parse($this->reportDate);

        $records = MedicalRecord::whereDate('created_at', $date)
            ->with(['consultationType', 'doctor', 'queue'])
            ->orderBy('created_at')
            ->get();

        $queues = Queue::whereDate('queue_date', $date)
            ->with(['consultationType', 'appointment'])
            ->orderBy('queue_number')
            ->get();

select * from `appointments` where date(`appointment_date`) >= '2026-02-01' and date(`appointment_date`) <= '2026-02-11'
select * from `consultation_types` where `consultation_types`.`id` in (34, 35, 36)
---
    public function appointmentStatsData(): array
    {
        $from = Carbon::parse($this->dateFrom)->startOfDay();
        $to = Carbon::parse($this->dateTo)->endOfDay();

        $appointments = Appointment::whereDate('appointment_date', '>=', $from->toDateString())
            ->whereDate('appointment_date', '<=', $to->toDateString())
            ->with('consultationType')
            ->get();

select * from `consultation_types` where `consultation_types`.`id` in (34)
select * from `queues` where `status` = 'completed' and date(`queue_date`) >= '2026-02-01' and date(`queue_date`) <= '2026-02-11'
---
    public function queuePerformanceData(): array
    {
        $from = Carbon::parse($this->dateFrom)->toDateString();
        $to = Carbon::parse($this->dateTo)->toDateString();

        $queues = Queue::where('status', 'completed')
            ->whereDate('queue_date', '>=', $from)
            ->whereDate('queue_date', '<=', $to)
            ->with('consultationType')
            ->get();