app/Livewire/Nurse/TodayQueue.php

select * from `appointments` where `status` = 'approved' and date(`appointment_date`) = '2026-02-20' order by `appointment_time` asc
select * from `consultation_types` where `is_active` = 1 order by `name` asc
---
            ->orderBy('queue_number')
            ->get();

        $pendingCheckIns = Appointment::query()
            ->with(['user.personalInformation', 'consultationType', 'queue'])
            ->where('status', 'approved')
            ->whereDate('appointment_date', today())
            ->orderBy('appointment_time')
            ->get();

        $consultationTypes = ConsultationType::query()
            ->where('is_active', true)
            ->orderBy('name')
            ->get();